let handler = async (m, { conn }) => {
    let _uptime = process.uptime() * 1000
    let uptime = clockString(_uptime)

conn.send2Button(m.chat,`
⋱ ⋮ ⋰
⋯ ◯ ⋯ ︵ 　　　　　　^v^
¸︵︵( ░░ )︵.︵.︵
(´░░░░░░ ') ░░░' )
 ︶ ¯ ︶ ︶ ︶ 　^v^　　^v^
╔┓┏╦━━╦┓╔┓╔━━╗╔╗
║┗┛║┗━╣┃║┃║╯╰║║║
║┏┓║┏━╣┗╣┗╣╰╯║╠╣
╚┛┗╩━━╩━╩━╩━━╝╚╝


*╭─̇─̇─̇─̇──̇─̇─̇─↷LoadingData*
*│[_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅] 2O%*
*│🥀*
*│[_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅] 4O%*
*│BOT📍*
*│[_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅] 6O%* 
*│HALO 🔥*
*│[_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅] 8O%* 
*│I\'M WHATSAPP BOT 🐣🐣*
*│[_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅_̲̅]1OO%*
*│*
*╰─̇─̇─̇──̇─̇─̇─̇─̇─̇─̇─̇─̇─̇─̇─̇─̇─̇─̇─̇➤*

 °°°🕊°°°°°°°🕊°°°°°°°°🕊°°°°°°°°🕊°°
■□■□■□■□■□■□■□■□ 🕊
▣▣▣▣▣▣▣▣▣▣▣▣▣▣▣▣▣▣🕊
❏ ❐            •                                     ⁙
           ❑ ❒           •                                ⁙
                     ❏ ❐           •
                              ❏ ❐            •
                                        ❑ ❒
*︻⋆︻⋆︻⋆︻⋆︻⋆︻⋆︻⋆︻⋆︻⋆︻⋆*
   *꒰ ۝ٜٜٜٜٜٜ◆ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟   ⃟ ♧ ⃟  ◆ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟   ۝ ꒱*
*︼⋆︼⋆︼⋆︼⋆︼⋆︼⋆︼⋆︼⋆︼⋆︼⋆*
╭━━•✵ ⃟  ⃟  ⃟✵•━━━━━━━━━━━━━╮
┃ *─★་‧ﾟ✵･･･─ ⋆⃟⊱✪⃝⃞⃝⊰⋆⃟⋆ ⋆⋆⃟⊱✪⃝⃞⃝⊰ ⋆*
┃ *LUCU BOT: ↷↷*
┃╭┈─────────────⩵꙰ཱི࿐
┃╰──STATUS BOT!*──➤ ↶↷*
┃ *⸙ ુོ➪ Aktif Selama
┃ *⸙ ુོ➪ ${uptime}
┃ 
┃ *─★‧ﾟ✵･･･─ ⋆⃟⊱✪⃝⃞⃝⊰⋆⃟⋆ ⋆⋆⃟⊱✪⃝⃞⃝⊰ ⋆*
╰━━━━━━━━━━━━━━━━━━━━━╯
*︻⋆︻⋆︻⋆︻⋆︻⋆︻⋆︻⋆︻⋆︻⋆︻⋆*
   *꒰ ۝ٜٜٜٜٜٜ◆ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟   ⃟ ♧ ⃟  ◆ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟   ۝ ꒱*
*︼⋆︼⋆︼⋆︼⋆︼⋆︼⋆︼⋆︼⋆︼⋆︼⋆*
    `.trim(), watermark, 'Menu', '.?', 'Owner', '.owner', m)
}
handler.help = ['uptime']
handler.tags = ['info']
handler.command = /^((run|up)time)$/i

module.exports = handler

function clockString(ms) {
    let h = isNaN(ms) ? '--' : Math.floor(ms / 3600000)
    let m = isNaN(ms) ? '--' : Math.floor(ms / 60000) % 60
    let s = isNaN(ms) ? '--' : Math.floor(ms / 1000) % 60
    return [h, m, s].map(v => v.toString().padStart(2, 0)).join(':')
}
